## Infrastructure Change Summary

#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation ✔️`success`
#### Plan 📖`success`
<details>

```terraform
[command]/home/runner/work/_temp/002b9c9a-d967-4cd6-aedb-892d5f42ae42/tofu-bin show -no-color plan
To view this run in a browser, visit:
https://app.terraform.io/app/HYTKY/do-tofu-test/runs/run-bZKaNZpto7M7eAkZ

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # digitalocean_droplet.www-1 will be created
  + resource "digitalocean_droplet" "www-1" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "www-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "fra1"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = "f0b06946c17ed0f12d3280e8b969e3ef34f559ea"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + www-1_ipv4_address = (known after apply)

Run status: planned and saved (confirmable)
Workspace is unlocked
::debug::OpenTofu exited with code 0.
::debug::stdout: To view this run in a browser, visit:%0Ahttps://app.terraform.io/app/HYTKY/do-tofu-test/runs/run-bZKaNZpto7M7eAkZ%0A%0AOpenTofu used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0AOpenTofu will perform the following actions:%0A%0A  # digitalocean_droplet.www-1 will be created%0A  + resource "digitalocean_droplet" "www-1" {%0A      + backups              = false%0A      + created_at           = (known after apply)%0A      + disk                 = (known after apply)%0A      + graceful_shutdown    = false%0A      + id                   = (known after apply)%0A      + image                = "ubuntu-20-04-x64"%0A      + ipv4_address         = (known after apply)%0A      + ipv4_address_private = (known after apply)%0A      + ipv6                 = false%0A      + ipv6_address         = (known after apply)%0A      + locked               = (known after apply)%0A      + memory               = (known after apply)%0A      + monitoring           = false%0A      + name                 = "www-1"%0A      + price_hourly         = (known after apply)%0A      + price_monthly        = (known after apply)%0A      + private_networking   = (known after apply)%0A      + region               = "fra1"%0A      + resize_disk          = true%0A      + size                 = "s-1vcpu-1gb"%0A      + status               = (known after apply)%0A      + urn                  = (known after apply)%0A      + user_data            = "f0b06946c17ed0f12d3280e8b969e3ef34f559ea"%0A      + vcpus                = (known after apply)%0A      + volume_ids           = (known after apply)%0A      + vpc_uuid             = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + www-1_ipv4_address = (known after apply)%0A%0ARun status: planned and saved (confirmable)%0AWorkspace is unlocked%0A
::debug::stderr: 
::debug::exitcode: 0
```

</details>
